susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32G47x.h
#define FDCAN3_RX_PA8_ PA8,GPIO_AF11
#define FDCAN3_RX_PB3_ PB3,GPIO_AF11
#define _FDCAN3_RX_PA8_ 1
#define _FDCAN3_RX_PB3_ 1

#define FDCAN3_TX_PA15_ PA15,GPIO_AF11
#define FDCAN3_TX_PB4_ PB4,GPIO_AF11
#define _FDCAN3_TX_PA15_ 1
#define _FDCAN3_TX_PB4_ 1

#define FMC_A0_PF10_ PF10,GPIO_AF12
#define _FMC_A0_PF10_ 1

#define FMC_A1_PF7_ PF7,GPIO_AF12
#define _FMC_A1_PF7_ 1

#define FMC_A10_PG0_ PG0,GPIO_AF12
#define _FMC_A10_PG0_ 1

#define FMC_A11_PG1_ PG1,GPIO_AF12
#define _FMC_A11_PG1_ 1

#define FMC_A12_PG2_ PG2,GPIO_AF12
#define _FMC_A12_PG2_ 1

#define FMC_A13_PG3_ PG3,GPIO_AF12
#define _FMC_A13_PG3_ 1

#define FMC_A14_PG4_ PG4,GPIO_AF12
#define _FMC_A14_PG4_ 1

#define FMC_A15_PG5_ PG5,GPIO_AF12
#define _FMC_A15_PG5_ 1

#define FMC_A16_PD11_ PD11,GPIO_AF12
#define _FMC_A16_PD11_ 1

#define FMC_A17_PD12_ PD12,GPIO_AF12
#define _FMC_A17_PD12_ 1

#define FMC_A18_PD13_ PD13,GPIO_AF12
#define _FMC_A18_PD13_ 1

#define FMC_A19_PE3_ PE3,GPIO_AF12
#define _FMC_A19_PE3_ 1

#define FMC_A2_PF2_ PF2,GPIO_AF12
#define _FMC_A2_PF2_ 1

#define FMC_A20_PE4_ PE4,GPIO_AF12
#define _FMC_A20_PE4_ 1

#define FMC_A21_PE5_ PE5,GPIO_AF12
#define _FMC_A21_PE5_ 1

#define FMC_A22_PE6_ PE6,GPIO_AF12
#define _FMC_A22_PE6_ 1

#define FMC_A23_PE2_ PE2,GPIO_AF12
#define _FMC_A23_PE2_ 1

#define FMC_A24_PF8_ PF8,GPIO_AF12
#define _FMC_A24_PF8_ 1

#define FMC_A25_PF9_ PF9,GPIO_AF12
#define _FMC_A25_PF9_ 1

#define FMC_A3_PF3_ PF3,GPIO_AF12
#define _FMC_A3_PF3_ 1

#define FMC_A4_PF4_ PF4,GPIO_AF12
#define _FMC_A4_PF4_ 1

#define FMC_A5_PF5_ PF5,GPIO_AF12
#define _FMC_A5_PF5_ 1

#define FMC_A6_PF12_ PF12,GPIO_AF12
#define _FMC_A6_PF12_ 1

#define FMC_A7_PF13_ PF13,GPIO_AF12
#define _FMC_A7_PF13_ 1

#define FMC_A8_PF14_ PF14,GPIO_AF12
#define _FMC_A8_PF14_ 1

#define FMC_A9_PF15_ PF15,GPIO_AF12
#define _FMC_A9_PF15_ 1

#define FMC_CLK_PD3_ PD3,GPIO_AF12
#define _FMC_CLK_PD3_ 1

#define FMC_D0_PD14_ PD14,GPIO_AF12
#define _FMC_D0_PD14_ 1

#define FMC_D1_PD15_ PD15,GPIO_AF12
#define _FMC_D1_PD15_ 1

#define FMC_D10_PE13_ PE13,GPIO_AF12
#define _FMC_D10_PE13_ 1

#define FMC_D11_PE14_ PE14,GPIO_AF12
#define _FMC_D11_PE14_ 1

#define FMC_D12_PE15_ PE15,GPIO_AF12
#define _FMC_D12_PE15_ 1

#define FMC_D13_PD8_ PD8,GPIO_AF12
#define _FMC_D13_PD8_ 1

#define FMC_D14_PD9_ PD9,GPIO_AF12
#define _FMC_D14_PD9_ 1

#define FMC_D15_PD10_ PD10,GPIO_AF12
#define _FMC_D15_PD10_ 1

#define FMC_D2_PD0_ PD0,GPIO_AF12
#define _FMC_D2_PD0_ 1

#define FMC_D3_PD1_ PD1,GPIO_AF12
#define _FMC_D3_PD1_ 1

#define FMC_D4_PE7_ PE7,GPIO_AF12
#define _FMC_D4_PE7_ 1

#define FMC_D5_PE8_ PE8,GPIO_AF12
#define _FMC_D5_PE8_ 1

#define FMC_D6_PE9_ PE9,GPIO_AF12
#define _FMC_D6_PE9_ 1

#define FMC_D7_PE10_ PE10,GPIO_AF12
#define _FMC_D7_PE10_ 1

#define FMC_D8_PE11_ PE11,GPIO_AF12
#define _FMC_D8_PE11_ 1

#define FMC_D9_PE12_ PE12,GPIO_AF12
#define _FMC_D9_PE12_ 1

#define FMC_DA0_PD14_ PD14,GPIO_AF12
#define _FMC_DA0_PD14_ 1

#define FMC_DA1_PD15_ PD15,GPIO_AF12
#define _FMC_DA1_PD15_ 1

#define FMC_DA10_PE13_ PE13,GPIO_AF12
#define _FMC_DA10_PE13_ 1

#define FMC_DA11_PE14_ PE14,GPIO_AF12
#define _FMC_DA11_PE14_ 1

#define FMC_DA12_PE15_ PE15,GPIO_AF12
#define _FMC_DA12_PE15_ 1

#define FMC_DA13_PD8_ PD8,GPIO_AF12
#define _FMC_DA13_PD8_ 1

#define FMC_DA14_PD9_ PD9,GPIO_AF12
#define _FMC_DA14_PD9_ 1

#define FMC_DA15_PD10_ PD10,GPIO_AF12
#define _FMC_DA15_PD10_ 1

#define FMC_DA2_PD0_ PD0,GPIO_AF12
#define _FMC_DA2_PD0_ 1

#define FMC_DA3_PD1_ PD1,GPIO_AF12
#define _FMC_DA3_PD1_ 1

#define FMC_DA4_PE7_ PE7,GPIO_AF12
#define _FMC_DA4_PE7_ 1

#define FMC_DA5_PE8_ PE8,GPIO_AF12
#define _FMC_DA5_PE8_ 1

#define FMC_DA6_PE9_ PE9,GPIO_AF12
#define _FMC_DA6_PE9_ 1

#define FMC_DA7_PE10_ PE10,GPIO_AF12
#define _FMC_DA7_PE10_ 1

#define FMC_DA8_PE11_ PE11,GPIO_AF12
#define _FMC_DA8_PE11_ 1

#define FMC_DA9_PE12_ PE12,GPIO_AF12
#define _FMC_DA9_PE12_ 1

#define FMC_INT_PG6_ PG6,GPIO_AF12
#define FMC_INT_PG7_ PG7,GPIO_AF12
#define _FMC_INT_PG6_ 1
#define _FMC_INT_PG7_ 1

#define FMC_NBL0_PE0_ PE0,GPIO_AF12
#define _FMC_NBL0_PE0_ 1

#define FMC_NBL1_PE1_ PE1,GPIO_AF12
#define _FMC_NBL1_PE1_ 1

#define FMC_NCE_PD7_ PD7,GPIO_AF12
#define FMC_NCE_PG9_ PG9,GPIO_AF12
#define _FMC_NCE_PD7_ 1
#define _FMC_NCE_PG9_ 1

#define FMC_NE1_PD7_ PD7,GPIO_AF12
#define _FMC_NE1_PD7_ 1

#define FMC_NE2_PG9_ PG9,GPIO_AF12
#define _FMC_NE2_PG9_ 1

#define FMC_NE3_PG8_ PG8,GPIO_AF12
#define _FMC_NE3_PG8_ 1

#define FMC_NE4_PF11_ PF11,GPIO_AF12
#define _FMC_NE4_PF11_ 1

#define FMC_NL_PB7_ PB7,GPIO_AF12
#define _FMC_NL_PB7_ 1

#define FMC_NOE_PD4_ PD4,GPIO_AF12
#define _FMC_NOE_PD4_ 1

#define FMC_NWAIT_PD6_ PD6,GPIO_AF12
#define _FMC_NWAIT_PD6_ 1

#define FMC_NWE_PD5_ PD5,GPIO_AF12
#define _FMC_NWE_PD5_ 1

#define HRTIM1_CHA1_PA8_ PA8,GPIO_AF13
#define _HRTIM1_CHA1_PA8_ 1

#define HRTIM1_CHA2_PA9_ PA9,GPIO_AF13
#define _HRTIM1_CHA2_PA9_ 1

#define HRTIM1_CHB1_PA10_ PA10,GPIO_AF13
#define _HRTIM1_CHB1_PA10_ 1

#define HRTIM1_CHB2_PA11_ PA11,GPIO_AF13
#define _HRTIM1_CHB2_PA11_ 1

#define HRTIM1_CHC1_PB12_ PB12,GPIO_AF13
#define _HRTIM1_CHC1_PB12_ 1

#define HRTIM1_CHC2_PB13_ PB13,GPIO_AF13
#define _HRTIM1_CHC2_PB13_ 1

#define HRTIM1_CHD1_PB14_ PB14,GPIO_AF13
#define _HRTIM1_CHD1_PB14_ 1

#define HRTIM1_CHD2_PB15_ PB15,GPIO_AF13
#define _HRTIM1_CHD2_PB15_ 1

#define HRTIM1_CHE1_PC8_ PC8,GPIO_AF3
#define _HRTIM1_CHE1_PC8_ 1

#define HRTIM1_CHE2_PC9_ PC9,GPIO_AF3
#define _HRTIM1_CHE2_PC9_ 1

#define HRTIM1_CHF1_PC6_ PC6,GPIO_AF13
#define _HRTIM1_CHF1_PC6_ 1

#define HRTIM1_CHF2_PC7_ PC7,GPIO_AF13
#define _HRTIM1_CHF2_PC7_ 1

#define HRTIM1_EEV1_PC12_ PC12,GPIO_AF3
#define _HRTIM1_EEV1_PC12_ 1

#define HRTIM1_EEV10_PC5_ PC5,GPIO_AF13
#define HRTIM1_EEV10_PC6_ PC6,GPIO_AF3
#define _HRTIM1_EEV10_PC5_ 1
#define _HRTIM1_EEV10_PC6_ 1

#define HRTIM1_EEV2_PC11_ PC11,GPIO_AF3
#define _HRTIM1_EEV2_PC11_ 1

#define HRTIM1_EEV3_PB7_ PB7,GPIO_AF13
#define _HRTIM1_EEV3_PB7_ 1

#define HRTIM1_EEV4_PB6_ PB6,GPIO_AF13
#define _HRTIM1_EEV4_PB6_ 1

#define HRTIM1_EEV5_PB9_ PB9,GPIO_AF13
#define _HRTIM1_EEV5_PB9_ 1

#define HRTIM1_EEV6_PB5_ PB5,GPIO_AF13
#define _HRTIM1_EEV6_PB5_ 1

