susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32G47x.h
#define HRTIM1_EEV7_PB4_ PB4,GPIO_AF13
#define _HRTIM1_EEV7_PB4_ 1

#define HRTIM1_EEV8_PB8_ PB8,GPIO_AF13
#define _HRTIM1_EEV8_PB8_ 1

#define HRTIM1_EEV9_PB3_ PB3,GPIO_AF13
#define _HRTIM1_EEV9_PB3_ 1

#define HRTIM1_FLT1_PA12_ PA12,GPIO_AF13
#define _HRTIM1_FLT1_PA12_ 1

#define HRTIM1_FLT2_PA15_ PA15,GPIO_AF13
#define _HRTIM1_FLT2_PA15_ 1

#define HRTIM1_FLT3_PB10_ PB10,GPIO_AF13
#define _HRTIM1_FLT3_PB10_ 1

#define HRTIM1_FLT4_PB11_ PB11,GPIO_AF13
#define _HRTIM1_FLT4_PB11_ 1

#define HRTIM1_FLT5_PB0_ PB0,GPIO_AF13
#define HRTIM1_FLT5_PC7_ PC7,GPIO_AF3
#define _HRTIM1_FLT5_PB0_ 1
#define _HRTIM1_FLT5_PC7_ 1

#define HRTIM1_FLT6_PC10_ PC10,GPIO_AF13
#define _HRTIM1_FLT6_PC10_ 1

#define HRTIM1_SCIN_PB2_ PB2,GPIO_AF13
#define HRTIM1_SCIN_PB6_ PB6,GPIO_AF12
#define _HRTIM1_SCIN_PB2_ 1
#define _HRTIM1_SCIN_PB6_ 1

#define HRTIM1_SCOUT_PB1_ PB1,GPIO_AF13
#define HRTIM1_SCOUT_PB3_ PB3,GPIO_AF12
#define _HRTIM1_SCOUT_PB1_ 1
#define _HRTIM1_SCOUT_PB3_ 1

#define I2C1_SCL_PA13_ PA13,GPIO_AF4
#define I2C1_SCL_PA15_ PA15,GPIO_AF4
#define I2C1_SCL_PB8_ PB8,GPIO_AF4
#define _I2C1_SCL_PA13_ 1
#define _I2C1_SCL_PA15_ 1
#define _I2C1_SCL_PB8_ 1

#define I2C1_SDA_PA14_ PA14,GPIO_AF4
#define I2C1_SDA_PB7_ PB7,GPIO_AF4
#define I2C1_SDA_PB9_ PB9,GPIO_AF4
#define _I2C1_SDA_PA14_ 1
#define _I2C1_SDA_PB7_ 1
#define _I2C1_SDA_PB9_ 1

#define I2C1_SMBA_PB5_ PB5,GPIO_AF4
#define _I2C1_SMBA_PB5_ 1

#define I2C2_SCL_PA9_ PA9,GPIO_AF4
#define I2C2_SCL_PC4_ PC4,GPIO_AF4
#define I2C2_SCL_PF6_ PF6,GPIO_AF4
#define _I2C2_SCL_PA9_ 1
#define _I2C2_SCL_PC4_ 1
#define _I2C2_SCL_PF6_ 1

#define I2C2_SDA_PA8_ PA8,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define _I2C2_SDA_PA8_ 1
#define _I2C2_SDA_PF0_ 1

#define I2C2_SMBA_PA10_ PA10,GPIO_AF4
#define I2C2_SMBA_PB12_ PB12,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define _I2C2_SMBA_PA10_ 1
#define _I2C2_SMBA_PB12_ 1
#define _I2C2_SMBA_PF2_ 1

#define I2C3_SCL_PA8_ PA8,GPIO_AF2
#define I2C3_SCL_PC8_ PC8,GPIO_AF8
#define I2C3_SCL_PF3_ PF3,GPIO_AF4
#define I2C3_SCL_PG7_ PG7,GPIO_AF4
#define _I2C3_SCL_PA8_ 1
#define _I2C3_SCL_PC8_ 1
#define _I2C3_SCL_PF3_ 1
#define _I2C3_SCL_PG7_ 1

#define I2C3_SDA_PB5_ PB5,GPIO_AF8
#define I2C3_SDA_PC11_ PC11,GPIO_AF8
#define I2C3_SDA_PC9_ PC9,GPIO_AF8
#define I2C3_SDA_PF4_ PF4,GPIO_AF4
#define I2C3_SDA_PG8_ PG8,GPIO_AF4
#define _I2C3_SDA_PB5_ 1
#define _I2C3_SDA_PC11_ 1
#define _I2C3_SDA_PC9_ 1
#define _I2C3_SDA_PF4_ 1
#define _I2C3_SDA_PG8_ 1

#define I2C3_SMBA_PA9_ PA9,GPIO_AF2
#define I2C3_SMBA_PB2_ PB2,GPIO_AF4
#define I2C3_SMBA_PG6_ PG6,GPIO_AF4
#define _I2C3_SMBA_PA9_ 1
#define _I2C3_SMBA_PB2_ 1
#define _I2C3_SMBA_PG6_ 1

#define I2C4_SCL_PA13_ PA13,GPIO_AF3
#define I2C4_SCL_PC6_ PC6,GPIO_AF8
#define I2C4_SCL_PF14_ PF14,GPIO_AF4
#define I2C4_SCL_PG3_ PG3,GPIO_AF4
#define _I2C4_SCL_PA13_ 1
#define _I2C4_SCL_PC6_ 1
#define _I2C4_SCL_PF14_ 1
#define _I2C4_SCL_PG3_ 1

#define I2C4_SDA_PB7_ PB7,GPIO_AF3
#define I2C4_SDA_PC7_ PC7,GPIO_AF8
#define I2C4_SDA_PF15_ PF15,GPIO_AF4
#define I2C4_SDA_PG4_ PG4,GPIO_AF4
#define _I2C4_SDA_PB7_ 1
#define _I2C4_SDA_PC7_ 1
#define _I2C4_SDA_PF15_ 1
#define _I2C4_SDA_PG4_ 1

#define I2C4_SMBA_PA14_ PA14,GPIO_AF3
#define I2C4_SMBA_PD11_ PD11,GPIO_AF4
#define I2C4_SMBA_PF13_ PF13,GPIO_AF4
#define _I2C4_SMBA_PA14_ 1
#define _I2C4_SMBA_PD11_ 1
#define _I2C4_SMBA_PF13_ 1

#define I2S2_CK_PB13_ PB13,GPIO_AF5
#define I2S2_CK_PF1_ PF1,GPIO_AF5
#define _I2S2_CK_PB13_ 1
#define _I2S2_CK_PF1_ 1

#define I2S2_MCK_PA8_ PA8,GPIO_AF5
#define I2S2_MCK_PC6_ PC6,GPIO_AF6
#define _I2S2_MCK_PA8_ 1
#define _I2S2_MCK_PC6_ 1

#define I2S2_SD_PA11_ PA11,GPIO_AF5
#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define _I2S2_SD_PA11_ 1
#define _I2S2_SD_PB15_ 1

#define I2S2_WS_PB12_ PB12,GPIO_AF5
#define I2S2_WS_PF0_ PF0,GPIO_AF5
#define _I2S2_WS_PB12_ 1
#define _I2S2_WS_PF0_ 1

#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PA9_ PA9,GPIO_AF5
#define I2S3_MCK_PC7_ PC7,GPIO_AF6
#define _I2S3_MCK_PA9_ 1
#define _I2S3_MCK_PC7_ 1

#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define I2S_CKIN_PA12_ PA12,GPIO_AF5
#define I2S_CKIN_PC9_ PC9,GPIO_AF5
#define _I2S_CKIN_PA12_ 1
#define _I2S_CKIN_PC9_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF5
#define IR_OUT_PB9_ PB9,GPIO_AF6
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define LPTIM1_ETR_PB6_ PB6,GPIO_AF11
#define LPTIM1_ETR_PC3_ PC3,GPIO_AF1
#define _LPTIM1_ETR_PB6_ 1
#define _LPTIM1_ETR_PC3_ 1

#define LPTIM1_IN1_PB5_ PB5,GPIO_AF11
#define LPTIM1_IN1_PC0_ PC0,GPIO_AF1
#define _LPTIM1_IN1_PB5_ 1
#define _LPTIM1_IN1_PC0_ 1

#define LPTIM1_IN2_PB7_ PB7,GPIO_AF11
#define LPTIM1_IN2_PC2_ PC2,GPIO_AF1
#define _LPTIM1_IN2_PB7_ 1
#define _LPTIM1_IN2_PC2_ 1

#define LPTIM1_OUT_PA14_ PA14,GPIO_AF1
#define LPTIM1_OUT_PB2_ PB2,GPIO_AF1
#define LPTIM1_OUT_PC1_ PC1,GPIO_AF1
#define _LPTIM1_OUT_PA14_ 1
#define _LPTIM1_OUT_PB2_ 1
#define _LPTIM1_OUT_PC1_ 1

#define LPUART1_CTS_PA6_ PA6,GPIO_AF12
#define LPUART1_CTS_PB13_ PB13,GPIO_AF8
#define LPUART1_CTS_PG5_ PG5,GPIO_AF8
#define _LPUART1_CTS_PA6_ 1
#define _LPUART1_CTS_PB13_ 1
#define _LPUART1_CTS_PG5_ 1

#define LPUART1_DE_PB1_ PB1,GPIO_AF12
#define LPUART1_DE_PB12_ PB12,GPIO_AF8
#define LPUART1_DE_PG6_ PG6,GPIO_AF8
#define _LPUART1_DE_PB1_ 1
#define _LPUART1_DE_PB12_ 1
#define _LPUART1_DE_PG6_ 1

#define LPUART1_RTS_PB1_ PB1,GPIO_AF12
#define LPUART1_RTS_PB12_ PB12,GPIO_AF8
#define LPUART1_RTS_PG6_ PG6,GPIO_AF8
#define _LPUART1_RTS_PB1_ 1
#define _LPUART1_RTS_PB12_ 1
#define _LPUART1_RTS_PG6_ 1

#define LPUART1_RX_PA3_ PA3,GPIO_AF12
#define LPUART1_RX_PB10_ PB10,GPIO_AF8
#define LPUART1_RX_PC0_ PC0,GPIO_AF8
#define LPUART1_RX_PG8_ PG8,GPIO_AF8
#define _LPUART1_RX_PA3_ 1
#define _LPUART1_RX_PB10_ 1
#define _LPUART1_RX_PC0_ 1
#define _LPUART1_RX_PG8_ 1

#define LPUART1_TX_PA2_ PA2,GPIO_AF12
#define LPUART1_TX_PB11_ PB11,GPIO_AF8
#define LPUART1_TX_PC1_ PC1,GPIO_AF8
#define LPUART1_TX_PG7_ PG7,GPIO_AF8
#define _LPUART1_TX_PA2_ 1
#define _LPUART1_TX_PB11_ 1
#define _LPUART1_TX_PC1_ 1
#define _LPUART1_TX_PG7_ 1

#define QUADSPI1_BK1_IO0_PB1_ PB1,GPIO_AF10
#define QUADSPI1_BK1_IO0_PE12_ PE12,GPIO_AF10
#define QUADSPI1_BK1_IO0_PF8_ PF8,GPIO_AF10
#define _QUADSPI1_BK1_IO0_PB1_ 1
#define _QUADSPI1_BK1_IO0_PE12_ 1
#define _QUADSPI1_BK1_IO0_PF8_ 1

#define QUADSPI1_BK1_IO1_PB0_ PB0,GPIO_AF10
#define QUADSPI1_BK1_IO1_PE13_ PE13,GPIO_AF10
#define QUADSPI1_BK1_IO1_PF9_ PF9,GPIO_AF10
#define _QUADSPI1_BK1_IO1_PB0_ 1
#define _QUADSPI1_BK1_IO1_PE13_ 1
#define _QUADSPI1_BK1_IO1_PF9_ 1

#define QUADSPI1_BK1_IO2_PA7_ PA7,GPIO_AF10
#define QUADSPI1_BK1_IO2_PE14_ PE14,GPIO_AF10
#define QUADSPI1_BK1_IO2_PF7_ PF7,GPIO_AF10
#define _QUADSPI1_BK1_IO2_PA7_ 1
#define _QUADSPI1_BK1_IO2_PE14_ 1
#define _QUADSPI1_BK1_IO2_PF7_ 1

#define QUADSPI1_BK1_IO3_PA6_ PA6,GPIO_AF10
#define QUADSPI1_BK1_IO3_PE15_ PE15,GPIO_AF10
#define QUADSPI1_BK1_IO3_PF6_ PF6,GPIO_AF10
#define _QUADSPI1_BK1_IO3_PA6_ 1
#define _QUADSPI1_BK1_IO3_PE15_ 1
#define _QUADSPI1_BK1_IO3_PF6_ 1

