susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32G47x.h
#define QUADSPI1_BK1_NCS_PA2_ PA2,GPIO_AF10
#define QUADSPI1_BK1_NCS_PB11_ PB11,GPIO_AF10
#define QUADSPI1_BK1_NCS_PE11_ PE11,GPIO_AF10
#define _QUADSPI1_BK1_NCS_PA2_ 1
#define _QUADSPI1_BK1_NCS_PB11_ 1
#define _QUADSPI1_BK1_NCS_PE11_ 1

#define QUADSPI1_BK2_IO0_PC1_ PC1,GPIO_AF10
#define QUADSPI1_BK2_IO0_PD4_ PD4,GPIO_AF10
#define _QUADSPI1_BK2_IO0_PC1_ 1
#define _QUADSPI1_BK2_IO0_PD4_ 1

#define QUADSPI1_BK2_IO1_PB2_ PB2,GPIO_AF10
#define QUADSPI1_BK2_IO1_PC2_ PC2,GPIO_AF10
#define QUADSPI1_BK2_IO1_PD5_ PD5,GPIO_AF10
#define _QUADSPI1_BK2_IO1_PB2_ 1
#define _QUADSPI1_BK2_IO1_PC2_ 1
#define _QUADSPI1_BK2_IO1_PD5_ 1

#define QUADSPI1_BK2_IO2_PC3_ PC3,GPIO_AF10
#define QUADSPI1_BK2_IO2_PD6_ PD6,GPIO_AF10
#define _QUADSPI1_BK2_IO2_PC3_ 1
#define _QUADSPI1_BK2_IO2_PD6_ 1

#define QUADSPI1_BK2_IO3_PC4_ PC4,GPIO_AF10
#define QUADSPI1_BK2_IO3_PD7_ PD7,GPIO_AF10
#define _QUADSPI1_BK2_IO3_PC4_ 1
#define _QUADSPI1_BK2_IO3_PD7_ 1

#define QUADSPI1_BK2_NCS_PD3_ PD3,GPIO_AF10
#define _QUADSPI1_BK2_NCS_PD3_ 1

#define QUADSPI1_CLK_PA3_ PA3,GPIO_AF10
#define QUADSPI1_CLK_PB10_ PB10,GPIO_AF10
#define QUADSPI1_CLK_PE10_ PE10,GPIO_AF10
#define QUADSPI1_CLK_PF10_ PF10,GPIO_AF10
#define _QUADSPI1_CLK_PA3_ 1
#define _QUADSPI1_CLK_PB10_ 1
#define _QUADSPI1_CLK_PE10_ 1
#define _QUADSPI1_CLK_PF10_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define RCC_MCO_PG10_ PG10,GPIO_AF0
#define _RCC_MCO_PA8_ 1
#define _RCC_MCO_PG10_ 1

#define RTC_OUT2_PB2_ PB2,GPIO_AF0
#define _RTC_OUT2_PB2_ 1

#define RTC_REFIN_PA1_ PA1,GPIO_AF0
#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PA1_ 1
#define _RTC_REFIN_PB15_ 1

#define SAI1_CK1_PA3_ PA3,GPIO_AF3
#define SAI1_CK1_PB8_ PB8,GPIO_AF3
#define SAI1_CK1_PE2_ PE2,GPIO_AF3
#define SAI1_CK1_PG7_ PG7,GPIO_AF3
#define _SAI1_CK1_PA3_ 1
#define _SAI1_CK1_PB8_ 1
#define _SAI1_CK1_PE2_ 1
#define _SAI1_CK1_PG7_ 1

#define SAI1_CK2_PA8_ PA8,GPIO_AF12
#define SAI1_CK2_PE5_ PE5,GPIO_AF3
#define _SAI1_CK2_PA8_ 1
#define _SAI1_CK2_PE5_ 1

#define SAI1_D1_PA10_ PA10,GPIO_AF12
#define SAI1_D1_PC3_ PC3,GPIO_AF3
#define SAI1_D1_PD6_ PD6,GPIO_AF3
#define SAI1_D1_PE6_ PE6,GPIO_AF3
#define _SAI1_D1_PA10_ 1
#define _SAI1_D1_PC3_ 1
#define _SAI1_D1_PD6_ 1
#define _SAI1_D1_PE6_ 1

#define SAI1_D2_PB9_ PB9,GPIO_AF3
#define SAI1_D2_PE4_ PE4,GPIO_AF3
#define _SAI1_D2_PB9_ 1
#define _SAI1_D2_PE4_ 1

#define SAI1_D3_PC5_ PC5,GPIO_AF3
#define SAI1_D3_PF10_ PF10,GPIO_AF13
#define _SAI1_D3_PC5_ 1
#define _SAI1_D3_PF10_ 1

#define SAI1_FS_A_PA9_ PA9,GPIO_AF14
#define SAI1_FS_A_PB9_ PB9,GPIO_AF14
#define SAI1_FS_A_PE4_ PE4,GPIO_AF13
#define _SAI1_FS_A_PA9_ 1
#define _SAI1_FS_A_PB9_ 1
#define _SAI1_FS_A_PE4_ 1

#define SAI1_FS_B_PA14_ PA14,GPIO_AF13
#define SAI1_FS_B_PA4_ PA4,GPIO_AF13
#define SAI1_FS_B_PB6_ PB6,GPIO_AF14
#define SAI1_FS_B_PE9_ PE9,GPIO_AF13
#define SAI1_FS_B_PF9_ PF9,GPIO_AF13
#define _SAI1_FS_B_PA14_ 1
#define _SAI1_FS_B_PA4_ 1
#define _SAI1_FS_B_PB6_ 1
#define _SAI1_FS_B_PE9_ 1
#define _SAI1_FS_B_PF9_ 1

#define SAI1_MCLK_A_PA3_ PA3,GPIO_AF13
#define SAI1_MCLK_A_PB8_ PB8,GPIO_AF14
#define SAI1_MCLK_A_PE2_ PE2,GPIO_AF13
#define SAI1_MCLK_A_PG7_ PG7,GPIO_AF13
#define _SAI1_MCLK_A_PA3_ 1
#define _SAI1_MCLK_A_PB8_ 1
#define _SAI1_MCLK_A_PE2_ 1
#define _SAI1_MCLK_A_PG7_ 1

#define SAI1_MCLK_B_PB4_ PB4,GPIO_AF14
#define SAI1_MCLK_B_PE10_ PE10,GPIO_AF13
#define SAI1_MCLK_B_PF7_ PF7,GPIO_AF13
#define _SAI1_MCLK_B_PB4_ 1
#define _SAI1_MCLK_B_PE10_ 1
#define _SAI1_MCLK_B_PF7_ 1

#define SAI1_SCK_A_PA8_ PA8,GPIO_AF14
#define SAI1_SCK_A_PB10_ PB10,GPIO_AF14
#define SAI1_SCK_A_PE5_ PE5,GPIO_AF13
#define _SAI1_SCK_A_PA8_ 1
#define _SAI1_SCK_A_PB10_ 1
#define _SAI1_SCK_A_PE5_ 1

#define SAI1_SCK_B_PB3_ PB3,GPIO_AF14
#define SAI1_SCK_B_PE8_ PE8,GPIO_AF13
#define SAI1_SCK_B_PF8_ PF8,GPIO_AF13
#define _SAI1_SCK_B_PB3_ 1
#define _SAI1_SCK_B_PE8_ 1
#define _SAI1_SCK_B_PF8_ 1

#define SAI1_SD_A_PA10_ PA10,GPIO_AF14
#define SAI1_SD_A_PC1_ PC1,GPIO_AF13
#define SAI1_SD_A_PC3_ PC3,GPIO_AF13
#define SAI1_SD_A_PD6_ PD6,GPIO_AF13
#define SAI1_SD_A_PE6_ PE6,GPIO_AF13
#define _SAI1_SD_A_PA10_ 1
#define _SAI1_SD_A_PC1_ 1
#define _SAI1_SD_A_PC3_ 1
#define _SAI1_SD_A_PD6_ 1
#define _SAI1_SD_A_PE6_ 1

#define SAI1_SD_B_PA13_ PA13,GPIO_AF13
#define SAI1_SD_B_PB5_ PB5,GPIO_AF12
#define SAI1_SD_B_PE3_ PE3,GPIO_AF13
#define SAI1_SD_B_PE7_ PE7,GPIO_AF13
#define SAI1_SD_B_PF6_ PF6,GPIO_AF3
#define _SAI1_SD_B_PA13_ 1
#define _SAI1_SD_B_PB5_ 1
#define _SAI1_SD_B_PE3_ 1
#define _SAI1_SD_B_PE7_ 1
#define _SAI1_SD_B_PF6_ 1

#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define SPI1_MISO_PG3_ PG3,GPIO_AF5
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PG3_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PG4_ PG4,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PG4_ 1

#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PG5_ PG5,GPIO_AF5
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PG5_ 1

#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define SPI1_SCK_PG2_ PG2,GPIO_AF5
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PG2_ 1

#define SPI2_MISO_PA10_ PA10,GPIO_AF5
#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define _SPI2_MISO_PA10_ 1
#define _SPI2_MISO_PB14_ 1

#define SPI2_MOSI_PA11_ PA11,GPIO_AF5
#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define _SPI2_MOSI_PA11_ 1
#define _SPI2_MOSI_PB15_ 1

#define SPI2_NSS_PB12_ PB12,GPIO_AF5
#define SPI2_NSS_PD15_ PD15,GPIO_AF6
#define SPI2_NSS_PF0_ PF0,GPIO_AF5
#define _SPI2_NSS_PB12_ 1
#define _SPI2_NSS_PD15_ 1
#define _SPI2_NSS_PF0_ 1

#define SPI2_SCK_PB13_ PB13,GPIO_AF5
#define SPI2_SCK_PF1_ PF1,GPIO_AF5
#define SPI2_SCK_PF10_ PF10,GPIO_AF5
#define SPI2_SCK_PF9_ PF9,GPIO_AF5
#define _SPI2_SCK_PB13_ 1
#define _SPI2_SCK_PF1_ 1
#define _SPI2_SCK_PF10_ 1
#define _SPI2_SCK_PF9_ 1

#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

