susanw1/zscript/receivers/generic-c++/zll/STM32/src/main/c++/zscript/stm32/devices/AlternateFunction/STM32G47x.h
#define TIM8_CH1_PA15_ PA15,GPIO_AF2
#define TIM8_CH1_PB6_ PB6,GPIO_AF5
#define TIM8_CH1_PC6_ PC6,GPIO_AF4
#define _TIM8_CH1_PA15_ 1
#define _TIM8_CH1_PB6_ 1
#define _TIM8_CH1_PC6_ 1

#define TIM8_CH1N_PA7_ PA7,GPIO_AF4
#define TIM8_CH1N_PB3_ PB3,GPIO_AF4
#define TIM8_CH1N_PC10_ PC10,GPIO_AF4
#define _TIM8_CH1N_PA7_ 1
#define _TIM8_CH1N_PB3_ 1
#define _TIM8_CH1N_PC10_ 1

#define TIM8_CH2_PA14_ PA14,GPIO_AF5
#define TIM8_CH2_PB8_ PB8,GPIO_AF10
#define TIM8_CH2_PC7_ PC7,GPIO_AF4
#define _TIM8_CH2_PA14_ 1
#define _TIM8_CH2_PB8_ 1
#define _TIM8_CH2_PC7_ 1

#define TIM8_CH2N_PB0_ PB0,GPIO_AF4
#define TIM8_CH2N_PB4_ PB4,GPIO_AF4
#define TIM8_CH2N_PC11_ PC11,GPIO_AF4
#define _TIM8_CH2N_PB0_ 1
#define _TIM8_CH2N_PB4_ 1
#define _TIM8_CH2N_PC11_ 1

#define TIM8_CH3_PB9_ PB9,GPIO_AF10
#define TIM8_CH3_PC8_ PC8,GPIO_AF4
#define _TIM8_CH3_PB9_ 1
#define _TIM8_CH3_PC8_ 1

#define TIM8_CH3N_PB1_ PB1,GPIO_AF4
#define TIM8_CH3N_PB5_ PB5,GPIO_AF3
#define TIM8_CH3N_PC12_ PC12,GPIO_AF4
#define _TIM8_CH3N_PB1_ 1
#define _TIM8_CH3N_PB5_ 1
#define _TIM8_CH3N_PC12_ 1

#define TIM8_CH4_PC9_ PC9,GPIO_AF4
#define TIM8_CH4_PD1_ PD1,GPIO_AF4
#define _TIM8_CH4_PC9_ 1
#define _TIM8_CH4_PD1_ 1

#define TIM8_CH4N_PC13_ PC13,GPIO_AF6
#define TIM8_CH4N_PD0_ PD0,GPIO_AF6
#define _TIM8_CH4N_PC13_ 1
#define _TIM8_CH4N_PD0_ 1

#define TIM8_ETR_PA0_ PA0,GPIO_AF10
#define TIM8_ETR_PB6_ PB6,GPIO_AF6
#define _TIM8_ETR_PA0_ 1
#define _TIM8_ETR_PB6_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define _UART1_DE_PA12_ 1

#define UART1_NSS_PA11_ PA11,GPIO_AF7
#define _UART1_NSS_PA11_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define UART1_RX_PC5_ PC5,GPIO_AF7
#define UART1_RX_PE1_ PE1,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1
#define _UART1_RX_PC5_ 1
#define _UART1_RX_PE1_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define UART1_TX_PC4_ PC4,GPIO_AF7
#define UART1_TX_PE0_ PE0,GPIO_AF7
#define UART1_TX_PG9_ PG9,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PC4_ 1
#define _UART1_TX_PE0_ 1
#define _UART1_TX_PG9_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PB5_ PB5,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PB5_ 1
#define _UART2_CK_PD7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_NSS_PA0_ PA0,GPIO_AF7
#define UART2_NSS_PD3_ PD3,GPIO_AF7
#define _UART2_NSS_PA0_ 1
#define _UART2_NSS_PD3_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA15_ PA15,GPIO_AF7
#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PB4_ PB4,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA15_ 1
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PB4_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA14_ PA14,GPIO_AF7
#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PB3_ PB3,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA14_ 1
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PB3_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PB12_ PB12,GPIO_AF7
#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PB12_ 1
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PA13_ PA13,GPIO_AF7
#define UART3_CTS_PB13_ PB13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PA13_ 1
#define _UART3_CTS_PB13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD12_ PD12,GPIO_AF7
#define UART3_DE_PF6_ PF6,GPIO_AF7
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PF6_ 1

#define UART3_NSS_PA13_ PA13,GPIO_AF7
#define UART3_NSS_PB13_ PB13,GPIO_AF7
#define UART3_NSS_PD11_ PD11,GPIO_AF7
#define _UART3_NSS_PA13_ 1
#define _UART3_NSS_PB13_ 1
#define _UART3_NSS_PD11_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define UART3_RTS_PF6_ PF6,GPIO_AF7
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PF6_ 1

#define UART3_RX_PB11_ PB11,GPIO_AF7
#define UART3_RX_PB8_ PB8,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define UART3_RX_PE15_ PE15,GPIO_AF7
#define _UART3_RX_PB11_ 1
#define _UART3_RX_PB8_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PD9_ 1
#define _UART3_RX_PE15_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PB9_ PB9,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PB9_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1

#define UART4_CTS_PB7_ PB7,GPIO_AF14
#define _UART4_CTS_PB7_ 1

#define UART4_DE_PA15_ PA15,GPIO_AF8
#define _UART4_DE_PA15_ 1

#define UART4_RTS_PA15_ PA15,GPIO_AF8
#define _UART4_RTS_PA15_ 1

#define UART4_RX_PC11_ PC11,GPIO_AF5
#define _UART4_RX_PC11_ 1

#define UART4_TX_PC10_ PC10,GPIO_AF5
#define _UART4_TX_PC10_ 1

#define UART5_CTS_PB5_ PB5,GPIO_AF14
#define _UART5_CTS_PB5_ 1

#define UART5_DE_PB4_ PB4,GPIO_AF8
#define _UART5_DE_PB4_ 1

#define UART5_RTS_PB4_ PB4,GPIO_AF8
#define _UART5_RTS_PB4_ 1

#define UART5_RX_PD2_ PD2,GPIO_AF5
#define _UART5_RX_PD2_ 1

#define UART5_TX_PC12_ PC12,GPIO_AF5
#define _UART5_TX_PC12_ 1

#define UART6_CTS_PA6_ PA6,GPIO_AF12
#define UART6_CTS_PB13_ PB13,GPIO_AF8
#define UART6_CTS_PG5_ PG5,GPIO_AF8
#define _UART6_CTS_PA6_ 1
#define _UART6_CTS_PB13_ 1
#define _UART6_CTS_PG5_ 1

#define UART6_DE_PB1_ PB1,GPIO_AF12
#define UART6_DE_PB12_ PB12,GPIO_AF8
#define UART6_DE_PG6_ PG6,GPIO_AF8
#define _UART6_DE_PB1_ 1
#define _UART6_DE_PB12_ 1
#define _UART6_DE_PG6_ 1

#define UART6_RTS_PB1_ PB1,GPIO_AF12
#define UART6_RTS_PB12_ PB12,GPIO_AF8
#define UART6_RTS_PG6_ PG6,GPIO_AF8
#define _UART6_RTS_PB1_ 1
#define _UART6_RTS_PB12_ 1
#define _UART6_RTS_PG6_ 1

#define UART6_RX_PA3_ PA3,GPIO_AF12
#define UART6_RX_PB10_ PB10,GPIO_AF8
#define UART6_RX_PC0_ PC0,GPIO_AF8
#define UART6_RX_PG8_ PG8,GPIO_AF8
#define _UART6_RX_PA3_ 1
#define _UART6_RX_PB10_ 1
#define _UART6_RX_PC0_ 1
#define _UART6_RX_PG8_ 1

#define UART6_TX_PA2_ PA2,GPIO_AF12
#define UART6_TX_PB11_ PB11,GPIO_AF8
#define UART6_TX_PC1_ PC1,GPIO_AF8
#define UART6_TX_PG7_ PG7,GPIO_AF8
#define _UART6_TX_PA2_ 1
#define _UART6_TX_PB11_ 1
#define _UART6_TX_PC1_ 1
#define _UART6_TX_PG7_ 1

#define UCPD1_FRSTX1_PA2_ PA2,GPIO_AF14
#define UCPD1_FRSTX1_PA5_ PA5,GPIO_AF14
#define UCPD1_FRSTX1_PA7_ PA7,GPIO_AF14
#define UCPD1_FRSTX1_PB0_ PB0,GPIO_AF14
#define UCPD1_FRSTX1_PC12_ PC12,GPIO_AF14
#define _UCPD1_FRSTX1_PA2_ 1
#define _UCPD1_FRSTX1_PA5_ 1
#define _UCPD1_FRSTX1_PA7_ 1
#define _UCPD1_FRSTX1_PB0_ 1
#define _UCPD1_FRSTX1_PC12_ 1

#define UCPD1_FRSTX2_PA2_ PA2,GPIO_AF14
#define UCPD1_FRSTX2_PA5_ PA5,GPIO_AF14
#define UCPD1_FRSTX2_PA7_ PA7,GPIO_AF14
#define UCPD1_FRSTX2_PB0_ PB0,GPIO_AF14
#define UCPD1_FRSTX2_PC12_ PC12,GPIO_AF14
#define _UCPD1_FRSTX2_PA2_ 1
#define _UCPD1_FRSTX2_PA5_ 1
#define _UCPD1_FRSTX2_PA7_ 1
#define _UCPD1_FRSTX2_PB0_ 1
#define _UCPD1_FRSTX2_PC12_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

